Revit 2026 API

# RevisionNumberingSequenceNumberType Property

---

Indicates the revision number type of the revision numbering sequence.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RevisionNumberType NumberType { get; }
```
```vb
Public ReadOnly Property NumberType As RevisionNumberType
	Get
```
```cpp
public:
property RevisionNumberType NumberType {
	RevisionNumberType get ();
}
```
```fsharp
member NumberType : RevisionNumberType with get
```

#### Property Value

RevisionNumberType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RevisionNumberingSequence doesn't own a valid revision settings for number type. |

This property can be used to figure out if a revision numbering sequence is numeric or alphanumeric. The returned RevisionNumberType is either RevisionNumberType::Numeric or RevisionNumberType::Alphanumeric.

#### Reference

RevisionNumberingSequence Class

Autodesk.Revit.DB Namespace